#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```
terraform
Acquiring state lock. This may take a few moments...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # openstack_compute_floatingip_associate_v2.fip will be created
  + resource "openstack_compute_floatingip_associate_v2" "fip" {
      + floating_ip = (known after apply)
      + id          = (known after apply)
      + instance_id = (known after apply)
      + region      = (known after apply)
    }

  # openstack_compute_instance_v2.cloud-api will be created
  + resource "openstack_compute_instance_v2" "cloud-api" {
      + access_ip_v4        = (known after apply)
      + access_ip_v6        = (known after apply)
      + all_metadata        = (known after apply)
      + all_tags            = (known after apply)
      + availability_zone   = (known after apply)
      + created             = (known after apply)
      + flavor_id           = "df25f80f-ed19-4e0b-805e-d34620ba0334"
      + flavor_name         = (known after apply)
      + force_delete        = false
      + id                  = (known after apply)
      + image_id            = "582840e6-3cc1-4133-ad20-6b302239ce19"
      + image_name          = (known after apply)
      + name                = "cloud-info-api"
      + power_state         = "active"
      + region              = (known after apply)
      + security_groups     = [
          + "HTTP-cloud-api",
          + "default",
        ]
      + stop_before_destroy = false
      + updated             = (known after apply)
      + user_data           = "4531e61602d4a104d04d1122d9cd0d4cb2106d50"

      + network {
          + access_network = false
          + fixed_ip_v4    = (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          + mac            = (known after apply)
          + name           = (known after apply)
          + port           = (known after apply)
          + uuid           = "d95ef0fe-bec9-4b90-ba34-a21204413098"
        }
    }

  # openstack_compute_secgroup_v2.secgroup will be created
  + resource "openstack_compute_secgroup_v2" "secgroup" {
      + description = "HTTP and HTTPS access"
      + id          = (known after apply)
      + name        = "HTTP-cloud-api"
      + region      = (known after apply)

      + rule {
          + cidr        = "0.0.0.0/0"
          + from_port   = 443
          + id          = (known after apply)
          + ip_protocol = "tcp"
          + self        = false
          + to_port     = 443
        }
      + rule {
          + cidr        = "0.0.0.0/0"
          + from_port   = 80
          + id          = (known after apply)
          + ip_protocol = "tcp"
          + self        = false
          + to_port     = 80
        }
    }

  # openstack_networking_floatingip_v2.fip will be created
  + resource "openstack_networking_floatingip_v2" "fip" {
      + address    = (known after apply)
      + all_tags   = (known after apply)
      + dns_domain = (known after apply)
      + dns_name   = (known after apply)
      + fixed_ip   = (known after apply)
      + id         = (known after apply)
      + pool       = "public-network"
      + port_id    = (known after apply)
      + region     = (known after apply)
      + subnet_id  = (known after apply)
      + tenant_id  = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + public_ip = (known after apply)

Warning: Argument is deprecated

  with provider["registry.terraform.io/terraform-provider-openstack/openstack"],
  on clouds.tf line 12, in provider "openstack":
  12: provider "openstack" {

Users not using loadbalancer resources can ignore this message. Support for
neutron-lbaas will be removed on next major release. Octavia will be the only
supported method for loadbalancer resources. Users using octavia will have to
remove 'use_octavia' option from the provider configuration block. Users
using neutron-lbaas will have to migrate/upgrade to octavia.

(and one more similar warning elsewhere)

Warning: Deprecated Resource

  with openstack_compute_secgroup_v2.secgroup,
  on main.tf line 12, in resource "openstack_compute_secgroup_v2" "secgroup":
  12: resource "openstack_compute_secgroup_v2" "secgroup" {

use openstack_networking_secgroup_v2 resource instead

(and 3 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @enolfc, Action: `pull_request`*